app/views/user_patients/_user_patient.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <tr>
    <td><%= user_patient.user.first_name + " " + user_patient.user.last_name + " ("+user_patient.user.user_type.user_type_name+")"%></td>