app/controllers/patients_controller.rb

  def create
    @patient = Patient.create(params[:patient])
---
INSERT INTO "patients" ("first_name", "last_name", "date_of_birth", "phone", "email_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @patient =Patient.find(params[:id])
    @user_patients = @patient.user_patients.reverse.paginate(:page => params[:page], :per_page => 5)
---
SELECT "user_patients".* FROM "user_patients" WHERE "user_patients"."patient_id" = $1  [["patient_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "user_patients" WHERE "user_patients"."patient_id" = $1 AND (archive is null)  [["patient_id", 1]]

  def index
    @patients = Patient.paginate(:page => params[:page])
---
SELECT  "patients".* FROM "patients" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "patients"

  def generate_invoice
    @patient = Patient.find(params[:id])
    @user_patients  = @patient.user_patients.where("archive is not '"+SessionsHelper::ARCHIVE+"'")
    respond_to do |format|
      format.html
      format.pdf do
        pdf = HmsPdfDocument.new(SessionsHelper::FOR_PATIENT, @user_patients, view_context)
        @user_patients.update_all :archive => SessionsHelper::ARCHIVE
---
SELECT  "user_patients".* FROM "user_patients" WHERE "user_patients"."patient_id" = $1 AND (archive is null) ORDER BY "user_patients"."id" ASC LIMIT $2  [["patient_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_patients" SET "archive" = 'A' WHERE "user_patients"."patient_id" = $1 AND (archive is null)  [["patient_id", 1]]