app/controllers/reports_controller.rb

  def reports
    @user_type = UserType.find_by(user_type_name: params[:type])
    if @user_type.user_type_name == SessionsHelper::STAFF
      @user_type_admin = UserType.find_by_user_type_name(SessionsHelper::ADMIN)
      @users = User.where("user_type_id = ? or user_type_id = ?", @user_type.id, @user_type_admin.id)
---
SELECT  "user_types".* FROM "user_types" WHERE "user_types"."user_type_name" = $1 LIMIT $2  [["user_type_name", "DOCTOR"], ["LIMIT", 1]]
SELECT  "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."user_type_id" = $1 LIMIT $2  [["user_type_id", 2], ["LIMIT", 1]]