app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
     @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("first_name", "last_name", "email_id", "user_type_id", "created_at", "updated_at", "encrypted_password", "salt") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.create(params[:user])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def change_password
   @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_password
    @user = User.find(params[:id])