app/controllers/user_patients_controller.rb

  def new
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
     @user_patient = UserPatient.create(params[:user_patient])
---
INSERT INTO "user_patients" ("user_id", "patient_id", "comments", "comment_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["patient_id", 1], ["comments", ""], ["comment_type_id", 2], ["created_at", "2017-11-10 03:07:15.753328"], ["updated_at", "2017-11-10 03:07:15.753328"]]